Okay. This is just so I can remember the syntax.

#+begin_src scala :scala-version 3.3.1 :dep '("com.lihaoyi::os-lib:0.9.2")
println("This is:" + os.pwd)
#+end_src

#+RESULTS:
: This is:/Users/swaldman/Sync/BaseFolders/development-why/gitproj/feedletter/playpen

#+begin_src scala :scala-version 3.3.1 :dep '("com.github.plokhotnyuk.jsoniter-scala::jsoniter-scala-core:2.25.0" "com.github.plokhotnyuk.jsoniter-scala::jsoniter-scala-macros:2.25.0" "com.mchange::mailutil:0.0.2-SNAPSHOT") 
    import com.mchange.mailutil.*

    import com.github.plokhotnyuk.jsoniter_scala.macros.*
    import com.github.plokhotnyuk.jsoniter_scala.core.*

    import java.nio.charset.Charset

    //given CodecMakerConfig.PrintCodec with {}
    //case class Point( x : Double, y : Double )
    //given pointCodec : JsonValueCodec[Point] = JsonCodecMaker.make

    given JsonValueCodec[Charset] with
      def nullValue: Charset = null
      def decodeValue(in : JsonReader, default : Charset): Charset = Charset.forName( in.readKeyAsString() )
      def encodeValue(cs : Charset, out: JsonWriter): Unit = out.writeKey( cs.name() )

    given addressCodec : JsonValueCodec[Smtp.Address] = JsonCodecMaker.make

    val json = writeToString(Smtp.Address("swaldman@mchange.com", None))
    println(json)
#+end_src

#+RESULTS:
#+begin_example
{"email":"swaldman@mchange.com"}
// defined object given_JsonValueCodec_Charset
lazy val addressCodec:
  com.github.plokhotnyuk.jsoniter_scala.core.JsonValueCodec[
    com.mchange.mailutil.Smtp.Address]
Generated JSON codec for type 'com.mchange.mailutil.Smtp.Address':
{
  def f0(i: scala.Int): java.lang.String = i match {
    case 0 =>
      "email"
    case 1 =>
      "displayName"
    case 2 =>
      "codec"
  }
  def f1(`i₂`: scala.Int): java.lang.String = `i₂` match {
    case 0 =>
      "charSet"
  }
  def d1(in: com.github.plokhotnyuk.jsoniter_scala.core.JsonReader, default: scala.io.Codec): scala.io.Codec = if (in.isNextToken(123)) {
    var _charSet: java.nio.charset.Charset = rs$line$4.given_JsonValueCodec_Charset.nullValue
    var p0: scala.Int = 1
    if (in.isNextToken(125).unary_!) {
      in.rollbackToken()
      var l: scala.Int = -1
      while (l.<(0).||(in.isNextToken(44))) {
        l = in.readKeyAsCharBuf()
        if (in.isCharBufEqualsTo(l, "charSet")) {
          if (p0.&(1).!=(0)) p0 = p0.^(1) else in.duplicatedKeyError(l)
          _charSet = rs$line$4.given_JsonValueCodec_Charset.decodeValue(in, _charSet)
        } else in.skip()
      }
      if (in.isCurrentToken(125).unary_!) in.objectEndOrCommaError() else ()
    } else ()
    if (p0.!=(0)) in.requiredFieldError(f1(java.lang.Integer.numberOfTrailingZeros(p0))) else ()
    new scala.io.Codec(_charSet)
  } else in.readNullOrTokenError[scala.io.Codec](default, 123)
  def d0(`in₂`: com.github.plokhotnyuk.jsoniter_scala.core.JsonReader, `default₂`: com.mchange.mailutil.Smtp.Address): com.mchange.mailutil.Smtp.Address = if (`in₂`.isNextToken(123)) {
    var _email: java.lang.String = (null: java.lang.String)
    var _displayName: scala.Option[scala.Predef.String] = com.mchange.mailutil.Smtp.Address.$lessinit$greater$default$2
    var _codec: scala.io.Codec = com.mchange.mailutil.Smtp.Address.$lessinit$greater$default$3
    var `p0₂`: scala.Int = 7
    if (`in₂`.isNextToken(125).unary_!) {
      `in₂`.rollbackToken()
      var `l₂`: scala.Int = -1
      while (`l₂`.<(0).||(`in₂`.isNextToken(44))) {
        `l₂` = `in₂`.readKeyAsCharBuf()
        if (`in₂`.isCharBufEqualsTo(`l₂`, "email")) {
          if (`p0₂`.&(1).!=(0)) `p0₂` = `p0₂`.^(1) else `in₂`.duplicatedKeyError(`l₂`)
          _email = `in₂`.readString(_email)
        } else if (`in₂`.isCharBufEqualsTo(`l₂`, "displayName")) {
          if (`p0₂`.&(2).!=(0)) `p0₂` = `p0₂`.^(2) else `in₂`.duplicatedKeyError(`l₂`)
          _displayName = if (`in₂`.isNextToken(110)) `in₂`.readNullOrError[scala.Option[scala.Predef.String]](_displayName, "expected value or null") else {
            `in₂`.rollbackToken()
            new scala.Some[java.lang.String](`in₂`.readString((null: java.lang.String)))
          }
        } else if (`in₂`.isCharBufEqualsTo(`l₂`, "codec")) {
          if (`p0₂`.&(4).!=(0)) `p0₂` = `p0₂`.^(4) else `in₂`.duplicatedKeyError(`l₂`)
          _codec = d1(`in₂`, _codec)
        } else `in₂`.skip()
      }
      if (`in₂`.isCurrentToken(125).unary_!) `in₂`.objectEndOrCommaError() else ()
    } else ()
    if (`p0₂`.&(1).!=(0)) `in₂`.requiredFieldError(f0(java.lang.Integer.numberOfTrailingZeros(`p0₂`.&(1)))) else ()
    new com.mchange.mailutil.Smtp.Address(_email, _displayName, _codec)
  } else `in₂`.readNullOrTokenError[com.mchange.mailutil.Smtp.Address](`default₂`, 123)
  def e1(x: scala.io.Codec, out: com.github.plokhotnyuk.jsoniter_scala.core.JsonWriter): scala.Unit = {
    out.writeObjectStart()
    out.writeNonEscapedAsciiKey("charSet")
    rs$line$4.given_JsonValueCodec_Charset.encodeValue(x.charSet, out)
    out.writeObjectEnd()
  }
  def e0(`x₂`: com.mchange.mailutil.Smtp.Address, `out₂`: com.github.plokhotnyuk.jsoniter_scala.core.JsonWriter): scala.Unit = {
    `out₂`.writeObjectStart()
    `out₂`.writeNonEscapedAsciiKey("email")
    `out₂`.writeVal(`x₂`.email)
    val v: scala.Option[java.lang.String] = `x₂`.displayName
    if (v.ne(scala.None).&&(v.!=(com.mchange.mailutil.Smtp.Address.$lessinit$greater$default$2))) {
      `out₂`.writeNonEscapedAsciiKey("displayName")
      `out₂`.writeVal(v.get)
    } else ()
    val `v₂`: scala.io.Codec = `x₂`.codec
    if (`v₂`.!=(com.mchange.mailutil.Smtp.Address.$lessinit$greater$default$3)) {
      `out₂`.writeNonEscapedAsciiKey("codec")
      e1(`v₂`, `out₂`)
    } else ()
    `out₂`.writeObjectEnd()
  }
  final class $anon() extends com.github.plokhotnyuk.jsoniter_scala.core.JsonValueCodec[com.mchange.mailutil.Smtp.Address] {
    def nullValue: com.mchange.mailutil.Smtp.Address = null
    def decodeValue(`in₃`: com.github.plokhotnyuk.jsoniter_scala.core.JsonReader, `default₃`: com.mchange.mailutil.Smtp.Address): com.mchange.mailutil.Smtp.Address = d0(`in₃`, `default₃`)
    def encodeValue(`x₃`: com.mchange.mailutil.Smtp.Address, `out₃`: com.github.plokhotnyuk.jsoniter_scala.core.JsonWriter): scala.Unit = e0(`x₃`, `out₃`)
  }
  (new $anon(): com.github.plokhotnyuk.jsoniter_scala.core.JsonValueCodec[com.mchange.mailutil.Smtp.Address])
}
val json: String = {"email":"swaldman@mchange.com"}
#+end_example
